/*
1. SNMP simple network management protocol 简单网络管理协议 
是一个网络管理员用来管理的工具相当于  一个app 所以是应用层
	数据链路层－＞IP层（网络层）－＞TCP/UDP层（传输层）－＞应用层
2. 传输层的数据叫段   网络层叫包     数据链路层叫帧   物理层叫比特流
3. 下列关于 http 状态码描述正确的是（）
	A. 404读取浏览器缓存，502错误网关          A中404是指找不到资源，A错，
	B. 404找不到资源，403服务器错误            B中403是禁止访问，B错
	C. 500服务器错误，304读取浏览器缓存
	D. 304服务器错误，200请求成功              D中304是指读取缓存，D错
	D. 500找不到资源，200请求成功              E中500是服务器错误，E错
	
4. TCP/IP参考模型的传输层上有两个主要的协议，用户数据报协议UDP(无连接)和传输控制协议TCP(面向连接)，主要区别如下：
(1)TCP是基于连接的，UDP是基于无连接，这是本质的区别，其他区别都是为之服务的。
(2)对系统资源的要求，TCP较多，UDP少。
(3)UDP数据包结构较简单，而TCP为了保证流量控制和拥塞控制，数据包结构较为复杂。
(4)TCP采用流模式，并进行编号，但UDP采用数据报模式
(5)TCP保证数据正确性，UDP可能丢包，TCP保证数据顺序，UDP不保证。
5.每个 IP 地址都可以有一个主机名，通过主机名得到该主机对应 ip 地址的过程叫（）

A. ip地址解析
B. 域名解析
C. 域名编译
D. ip地址编译
B
域名解析是指将域名解析为IP。域名是IP的代名词，没有人会去记IP，访问网站都是访问域名。计算机名不同于账户名，计算机名又叫主机名。因特网上的主机或 Web 站点由主机名识别。主机名有时称为域名。主机名映射到 IP 地址
	
	
	
*/