/*\
1. IP地址块202.113.79.128/27、202.113.79.160/27和202.113.79.192/27经过聚合后可用的地址数为（　　）。
A	64
B	92
C	126
D	128
【答案】
C
【解析】
地址块202.113.79.128/27可表示为11001010 01110001 01001111 10000000
地址块202.113.79.160/27可表示为11001010 01110001 01001111 10100000
地址块202.113.79.192/27可表示为11001010 01110001 01001111 11000000
从以上三个地址块的二进制形式中可以看出，前25位是完全相同的。因此三个地址块聚合后是202.113.79.128，聚合后的主机号占7位，可用地址数是27－2＝126个。
2. 　icmp协议是IP层的附属协议，是介于IP层和TCP层之间的协议，一般认为属于IP层协议。IP协议用它来与其他主机或路由器交换错误报文和其他的一些网络情况。在ICMP包重携带了控制信息和故障恢复信息。主要用于路由器主机向其他路由器或者主机发送出错报文的控制信息​。
3. 对于访问URL，无bai论使用大写字母还是小写字母，系统du都将为zhi您指向您指定的网站页面。
对于显示URL，适当地使dao用大写字母特别是首字母大写，可以帮助网民更快地识别域名含义
*/